docs: improve and polish README.md
